## DA 320 

| Key         | Value |
| ----------- | ----------- |
| Assignment  | Basics of Transformation |
| Author   | Ted Spence        |
| Date   | 2023-05-20        |

This example notebook contains tutorials on how to transform data in Pandas.

You can use the header markdown segment of this page as an example of markdown tables.

***
# Adding a new column using Pandas transformation
***

In this example, we take a small Pandas dataframe with numbers and dates stored as strings, and we convert them to numbers and dates using a built-in transformation function.

In [6]:
import pandas

# Create a raw data set and print it out
df = pandas.DataFrame({
    "date_strings": ["2022-10-01", "2022-10-02", "2022-10-03"],
    "score_strings": ["57", "68", "22"],
})

# Transform and standardize the columns
df.insert(0, "dates", pandas.to_datetime(df.date_strings, errors='coerce'))
df.insert(2, "scores", pandas.to_numeric(df.score_strings, errors='coerce'))

# Print out the transformed dataset - since this is bring printed as strings, you won't see much difference, but the new values are now numeric and date-time.
df.head()

       dates date_strings  scores score_strings
0 2022-10-01   2022-10-01      57            57
1 2022-10-02   2022-10-02      68            68
2 2022-10-03   2022-10-03      22            22

***
# Adding a new column using lambdas
***

This time we'll construct a function (called a lambda) and apply it across all rows in the data set.  The function will create a new column.

In [11]:
# Create a raw data set and print it out
df = pandas.DataFrame({
    "team1_score": [6, 4, 3],
    "team2_score": [4, 0, 8],
})

# Transform and standardize the columns. Note that "axis = 1" must be specified to have it run by columns
df.insert(0, "total_scores", df.apply(lambda row : row["team1_score"] + row["team2_score"], axis = 1))

# Print out the transformed dataset - since this is bring printed as strings, you won't see much difference, but the new values are now numeric and date-time.
df.head()

   total_scores  team1_score  team2_score
0            10            6            4
1             4            4            0
2            11            3            8

***
# Merge two dataframes based on key field
***

In this example we'll take two different dataframes that have some overlap and merge them together.  When matches don't exist, we will allow the fields to be null.

In [15]:
# Create a raw data set and print it out
cities = pandas.DataFrame({
    "name": ["Alice", "Bob", "Charlie"],
    "city": ["Arcadia", "Bellevue", "Chicago"],
})
emails = pandas.DataFrame({
    "name": ["Bob", "Charlie", "David"],
    "email": ["bob@example.com", "charlie@example.com", "david@example.com"],
})

# Transform and standardize the columns. Note that "axis = 1" must be specified to have it run by columns
merged = cities.merge(emails, how="outer", on="name")
merged.head()

      name      city                email
0    Alice   Arcadia                  NaN
1      Bob  Bellevue      bob@example.com
2  Charlie   Chicago  charlie@example.com
3    David       NaN    david@example.com

***
# Filtering to a subset of data
***

Filter a Pandas dataset to a smaller amount of data.

In [1]:
import pandas

# A bunch of numbers in a Pandas dataframe
employees = pandas.DataFrame({
    "hire_dates": ["1993-06-12", "1993-03-22", "1993-07-15", "1993-11-14", "1995-09-09", "1995-10-09", "1995-12-31", "1996-12-02"],
    "names": ["Alice", "Bob", "Charlie", "Dennis", "Elaine", "Frankie", "Grace", "Howard"],
})

# Extract the years from the pandas dataframe
employees["hire_dates"] = pandas.to_datetime(employees.hire_dates, errors='coerce')
employees["hire_year"] = employees["hire_dates"].dt.year
subset = employees[employees["hire_year"] == 1993]
subset.head()

  hire_dates    names  hire_year
0 1993-06-12    Alice       1993
1 1993-03-22      Bob       1993
2 1993-07-15  Charlie       1993
3 1993-11-14   Dennis       1993